Revit 2015 API
ExternalDefinitonCreationOptions Class
 An option class used for creating a new shared parameter definition, including options such as name, type, visibility, Guid description and modifiable flag.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public class ExternalDefinitonCreationOptions : IDisposable
Visual Basic
Public Class ExternalDefinitonCreationOptions _
	Implements IDisposable
Visual C++
public ref class ExternalDefinitonCreationOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalDefinitonCreationOptions
See Also
ExternalDefinitonCreationOptions Members
Autodesk.Revit.DB Namespace